# def hello():
#     print('Hello, World!')
#
#
#
#
#
# hello()
#
#
# def hello_name(name):
#     print(f"Hello {name}")
#
# # Напишите функцию, которая отображает на экран
# # форматированный текст, указанный ниже:
# # “Don't let the noise of others' opinions
# # drown out your own inner voice.”
# # Steve Jobs

# def steve_jobs():
#     print("“Don\'t let the noise of others\' opinions \ndrown out your own inner voice.”\n                Steve Jobs")
# steve_jobs()
#
# Напишите функцию, которая принимает два числа
# в качестве параметра и отображает все нечетные числа
# между ними.


#
# def odds(x, y):
#     for i in range(x, y+1):
#         if i % 2 != 0:
#             print(i)
# x = input("Input first number:")
# y = input("Input second number:")
# odds(x, y)
#
#
# Напишите функцию, которая возвращает максимальное из четырёх чисел. Числа передаются в качестве
# параметров.



# a = 3
# b = 4
# c = 7
# d = 2
#
# high_number = max(a, b ,c ,d)
# print(high_number)


# Напишите функцию, которая отображает горизонтальную или вертикальную линию из некоторого символа.
# Функция принимает в качестве параметра: длину линии,
# направление, символ.

# def line(x,sym):
#     print(sym * x)
#     print(sym * x, sep='\n')
# line(4, "f")

n = 'Andrii Batyuk'
print(n[0], n[1], n[2])







